## Plan Result

[CI link](https://github.com/kyma-project/test-infra/actions/runs/8265321725)



<pre><code>Plan: 4 to add, 1 to change, 0 to destroy.</code></pre>

* Create
  * github_actions_variable.gcp_gitleaks_sercet_accesor_service_account_email["test-infra"]
  * github_actions_variable.github_gitleaks_license_secret_name["test-infra"]
  * google_service_account.gitleaks_secret_accesor
  * google_service_account_iam_binding.gitleaks_workload_identity_federation_binding["test-infra"]
* Update
  * module.service_account_keys_cleaner.google_cloud_scheduler_job.service_account_keys_cleaner



<details><summary>Change Result (Click me)</summary>

```hcl

  # github_actions_variable.gcp_gitleaks_sercet_accesor_service_account_email["test-infra"] will be created
  + resource "github_actions_variable" "gcp_gitleaks_sercet_accesor_service_account_email" {
      + created_at    = (known after apply)
      + id            = (known after apply)
      + repository    = "test-infra"
      + updated_at    = (known after apply)
      + value         = (known after apply)
      + variable_name = "GCP_GITLEAKS_SERCET_ACCESOR_SERVICE_ACCOUNT_EMAIL"
    }

  # github_actions_variable.github_gitleaks_license_secret_name["test-infra"] will be created
  + resource "github_actions_variable" "github_gitleaks_license_secret_name" {
      + created_at    = (known after apply)
      + id            = (known after apply)
      + repository    = "test-infra"
      + updated_at    = (known after apply)
      + value         = "gitleaks-kyma-license-key"
      + variable_name = "GH_GITLEAKS_LICENSE_SECRET_NAME"
    }

  # google_service_account.gitleaks_secret_accesor will be created
  + resource "google_service_account" "gitleaks_secret_accesor" {
      + account_id   = "gitleaks-secret-accesor"
      + description  = "Identity of gitleaks. It's used to retrieve secrets from secret manager"
      + disabled     = false
      + display_name = "gitleaks-secret-accesor"
      + email        = (known after apply)
      + id           = (known after apply)
      + member       = (known after apply)
      + name         = (known after apply)
      + project      = "sap-kyma-prow"
      + unique_id    = (known after apply)
    }

  # google_service_account_iam_binding.gitleaks_workload_identity_federation_binding["test-infra"] will be created
  + resource "google_service_account_iam_binding" "gitleaks_workload_identity_federation_binding" {
      + etag               = (known after apply)
      + id                 = (known after apply)
      + members            = [
          + "principal://iam.googleapis.com/projects/sap-kyma-prow/locations/global/workloadIdentityPools/projects/351981214969/locations/global/workloadIdentityPools/github-com-kyma-project/subject/repository_id:147495537:repository_owner_id:39153523:workflow:gitleaks",
        ]
      + role               = "roles/iam.workloadIdentityUser"
      + service_account_id = (known after apply)
    }

  # module.service_account_keys_cleaner.google_cloud_scheduler_job.service_account_keys_cleaner will be updated in-place
  ~ resource "google_cloud_scheduler_job" "service_account_keys_cleaner" {
        id               = "projects/sap-kyma-prow/locations/europe-west3/jobs/service-account-keys-cleaner"
        name             = "service-account-keys-cleaner"
        # (8 unchanged attributes hidden)

      ~ http_target {
          ~ uri         = "https://service-account-keys-cleaner-q25ja7ch3q-ez.a.run.app/?project=sap-kyma-prow&age=24" -> "https://service-account-keys-cleaner-q25ja7ch3q-ez.a.run.app?project=sap-kyma-prow&age=24"
            # (2 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
    }

Plan: 4 to add, 1 to change, 0 to destroy.
```

</details>









<!-- github-comment: {"Command":"plan","JobName":"pull-plan-prod-terraform","PRNumber":10114,"Program":"tfcmt","SHA1":"7db295e0275fdcfe7f9cc59ad1fe2c4814e5a1ff","Vars":{},"WorkflowName":"Pull Plan Prod Terraform"} -->